wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Examples/DSI/DSI_video_mode_display/dsi_lcd.c
/*!
    \file    dsi_lcd.c
    \brief   the DSI LCD configuration file

    \version 2025-09-29, V0.2.0, firmware for GD32H77x
*/

/*
    Copyright (c) 2025, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification,
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice,
       this list of conditions and the following disclaimer in the documentation
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors
       may be used to endorse or promote products derived from this software without
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED.
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT,
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY
OF SUCH DAMAGE.
*/

#include "gd32h77x.h"
#include "gd32h77x_dsi.h"
#include "dsi_lcd.h"
#include "systick.h"
#include <string.h>
#include <stdbool.h>

#define MDMA_MAX_BYTES  64
#define ceil(n, d) ((n)/(d) + (((n)%(d)) != 0 ? 1 : 0))
#define max(x, y)  ((x) > (y) ? (x) : (y))

__IO uint8_t lp_rd_avail = 0;
__IO uint8_t ar_mode_bus_busy = 0;

#ifdef LCM_TEST
/* DPHY low power clk hz */
uint32_t pixel_clk   = PIXEL_CLK;
/* DPHY low power clk hz */
uint32_t lpclk   = LP_CLK;
/* DPHY high speed rate bps */
uint32_t hs_rate = HS_RATE;
#endif

static dsi_dphy_cfg_struct dsi_cfg;

const uint8_t __attribute__((aligned(8))) logo[] = {
#ifdef LCM_VD480x800_TEST
#if PIXEL_FOMART == DSI_FMT_RGB888
#include "logo_320x480_rgb888.h"
#elif PIXEL_FOMART == DSI_FMT_RGB565
#include "logo_480x800_rgb565.h"
#endif
#endif /* LCM_VD480x800_TEST */
};

static lcm_info_struct lcm_info = {
#ifdef LCM_TEST
    .channel    = DSI_VIRTUAL_CHANNEL_0,
    .fps        = 60,
#ifdef LCM_VIDEO_MODE_TEST
    .mode       = VIDEO_BURST_MODE,
#else
    .mode       = COMMAND_MODE,
#endif /* LCM_VIDEO_MODE_TEST */
    .lane_num   = DATA_LANE_NUM,
    .format     = (pixel_format_enum)PIXEL_FOMART,
    .hact       = ACTIVE_WIDTH,
    .hsw        = HORIZONTAL_SYNCHRONOUS_PULSE,
    .hbp        = HORIZONTAL_BACK_PORCH,
    .hfp        = HORIZONTAL_FRONT_PORCH,
    .vact       = ACTIVE_HEIGHT,
    .vsw        = VERTICAL_SYNCHRONOUS_PULSE,
    .vbp        = VERTICAL_BACK_PORCH,
    .vfp        = VERTICAL_FRONT_PORCH,
#endif /* LCM_TEST */
};

static lcm_init_cmd_struct init_cmds[] = {
#ifdef LCM_VD480x800_TEST /* LCM_VD480x800_TEST */
    _INIT_CMD(MIPI_DSI_DCS_LONG_WRITE, LOW_POWER, 0, 0xff, 0x77, 0x01, 0x00, 0x00, 0x13),
    _INIT_CMD(MIPI_DSI_DCS_LONG_WRITE, LOW_POWER, 0, 0xef, 0x08),
    _INIT_CMD(MIPI_DSI_DCS_LONG_WRITE, LOW_POWER, 0, 0xff, 0x77, 0x01, 0x00, 0x00, 0x10),
    /* 480*800 */
    _INIT_CMD(MIPI_DSI_DCS_LONG_WRITE, LOW_POWER, 0, 0xc0, ((ACTIVE_HEIGHT) / 8 - 1), 0x00),
    _INIT_CMD(MIPI_DSI_DCS_LONG_WRITE, LOW_POWER, 0, 0xc1, 0x10, 0x02),
    _INIT_CMD(MIPI_DSI_DCS_LONG_WRITE, LOW_POWER, 0, 0xc2, 0x31, 0x08),
    _INIT_CMD(MIPI_DSI_DCS_LONG_WRITE, LOW_POWER, 0, 0xcc, 0x10),
    _INIT_CMD(MIPI_DSI_DCS_LONG_WRITE, LOW_POWER, 0, 0xb0, 0xc0, 0x0c, 0x92, 0x0c, 0x10, 0x05, 0x02, 0x0d, 0x07, 0x21, 0x04, 0x53, 0x11, 0x6a, 0x32, 0x1f),
    _INIT_CMD(MIPI_DSI_DCS_LONG_WRITE, LOW_POWER, 0, 0xb1, 0xc0, 0x87, 0xcf, 0x0c, 0x10, 0x06, 0x00, 0x03, 0x08, 0x1d, 0x06, 0x54, 0x12, 0xe6, 0xec, 0x0f),
    _INIT_CMD(MIPI_DSI_DCS_LONG_WRITE, LOW_POWER, 0, 0xff, 0x77, 0x01, 0x00, 0x00, 0x11),
    _INIT_CMD(MIPI_DSI_DCS_LONG_WRITE, LOW_POWER, 0, 0xb0, 0x5d),
    _INIT_CMD(MIPI_DSI_DCS_LONG_WRITE, LOW_POWER, 0, 0xb1, 0x62),
    _INIT_CMD(MIPI_DSI_DCS_LONG_WRITE, LOW_POWER, 0, 0xb2, 0x87),
    _INIT_CMD(MIPI_DSI_DCS_LONG_WRITE, LOW_POWER, 0, 0xb3, 0x80),
    _INIT_CMD(MIPI_DSI_DCS_LONG_WRITE, LOW_POWER, 0, 0xb5, 0x49),
    _INIT_CMD(MIPI_DSI_DCS_LONG_WRITE, LOW_POWER, 0, 0xb7, 0x85),
    _INIT_CMD(MIPI_DSI_DCS_LONG_WRITE, LOW_POWER, 0, 0xb8, 0x22),
    _INIT_CMD(MIPI_DSI_DCS_LONG_WRITE, LOW_POWER, 0, 0xc0, 0x09),
    _INIT_CMD(MIPI_DSI_DCS_LONG_WRITE, LOW_POWER, 0, 0xc1, 0x78),
    _INIT_CMD(MIPI_DSI_DCS_LONG_WRITE, LOW_POWER, 0, 0xc2, 0x78),
    _INIT_CMD(MIPI_DSI_DCS_LONG_WRITE, LOW_POWER, 0, 0xd0, 0x88),
    _INIT_CMD(MIPI_DSI_DCS_LONG_WRITE, LOW_POWER, 100, 0xee, 0x42),
    _INIT_CMD(MIPI_DSI_DCS_LONG_WRITE, LOW_POWER, 0, 0xe0, 0x00, 0x00, 0x02),
    _INIT_CMD(MIPI_DSI_DCS_LONG_WRITE, LOW_POWER, 0, 0xe1, 0x04, 0xa0, 0x06, 0xa0, 0x05, 0xa0, 0x07, 0xa0, 0x00, 0x44, 0x44),
    _INIT_CMD(MIPI_DSI_DCS_LONG_WRITE, LOW_POWER, 0, 0xe2, 0x00, 0x00, 0x33, 0x33, 0x01, 0xa0, 0x00, 0x00, 0x01, 0xa0, 0x00, 0x00),
    _INIT_CMD(MIPI_DSI_DCS_LONG_WRITE, LOW_POWER, 0, 0xe3, 0x00, 0x00, 0x33, 0x33),
    _INIT_CMD(MIPI_DSI_DCS_LONG_WRITE, LOW_POWER, 0, 0xe4, 0x44, 0x44),
    _INIT_CMD(MIPI_DSI_DCS_LONG_WRITE, LOW_POWER, 0, 0xe5, 0x0c, 0x30, 0xa0, 0xa0, 0x0e, 0x32, 0xa0, 0xa0, 0x08, 0x2c, 0xa0, 0xa0, 0x0a, 0x2e, 0xa0, 0xa0),
    _INIT_CMD(MIPI_DSI_DCS_LONG_WRITE, LOW_POWER, 0, 0xe6, 0x00, 0x00, 0x33, 0x33),
    _INIT_CMD(MIPI_DSI_DCS_LONG_WRITE, LOW_POWER, 0, 0xe7, 0x44, 0x44),
    _INIT_CMD(MIPI_DSI_DCS_LONG_WRITE, LOW_POWER, 0, 0xe8, 0x0d, 0x31, 0xa0, 0xa0, 0x0f, 0x33, 0xa0, 0xa0, 0x09, 0x2d, 0xa0, 0xa0, 0x0b, 0x2f, 0xa0, 0xa0),
    _INIT_CMD(MIPI_DSI_DCS_LONG_WRITE, LOW_POWER, 0, 0xeb, 0x00, 0x01, 0xe4, 0xe4, 0x44, 0x88, 0x00),
    _INIT_CMD(MIPI_DSI_DCS_LONG_WRITE, LOW_POWER, 0, 0xed, 0xff, 0xf5, 0x47, 0x6f, 0x0b, 0xa1, 0xa2, 0xbf, 0xfb, 0x2a, 0x1a, 0xb0, 0xf6, 0x74, 0x5f, 0xff),
    _INIT_CMD(MIPI_DSI_DCS_LONG_WRITE, LOW_POWER, 0, 0xef, 0x08, 0x08, 0x08, 0x40, 0x3f, 0x64),
    _INIT_CMD(MIPI_DSI_DCS_LONG_WRITE, LOW_POWER, 0, 0xff, 0x77, 0x01, 0x00, 0x00, 0x13),
    _INIT_CMD(MIPI_DSI_DCS_LONG_WRITE, LOW_POWER, 0, 0xe8, 0x00, 0x0e),
    _INIT_CMD(MIPI_DSI_DCS_LONG_WRITE, LOW_POWER, 0, 0xff, 0x77, 0x01, 0x00, 0x00, 0x00),
    _INIT_CMD(MIPI_DSI_DCS_LONG_WRITE, LOW_POWER, 120, 0x11),
    _INIT_CMD(MIPI_DSI_DCS_LONG_WRITE, LOW_POWER, 0, 0xff, 0x77, 0x01, 0x00, 0x00, 0x13),
    _INIT_CMD(MIPI_DSI_DCS_LONG_WRITE, LOW_POWER, 10, 0xe8, 0x00, 0x0c),
    _INIT_CMD(MIPI_DSI_DCS_LONG_WRITE, LOW_POWER, 0, 0xe8, 0x00, 0x00),
    _INIT_CMD(MIPI_DSI_DCS_LONG_WRITE, LOW_POWER, 0, 0xff, 0x77, 0x01, 0x00, 0x00, 0x00),
    _INIT_CMD(MIPI_DSI_DCS_LONG_WRITE, LOW_POWER, 0, 0x36, 0x00),
    _INIT_CMD(MIPI_DSI_DCS_LONG_WRITE, LOW_POWER, 0, 0x3a, 0x70),
    _INIT_CMD(MIPI_DSI_DCS_LONG_WRITE, LOW_POWER, 20, 0x29),
#endif /* LCM_VD480x800_TEST */

