wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Examples/DSI/DSI_video_mode_display/dsi_lcd.c
};

void dsi_command_mode_supported_set(uint32_t supported);
void dsi_wrapper_rgb_data_format_set(uint32_t format);

static uint32_t dsi_safe_read_u32(const void *ptr, uint32_t offset)
{
    uint32_t value = 0U;
    const uint8_t *byte_ptr = (const uint8_t *)ptr;

    (void)memcpy(&value, &byte_ptr[offset], sizeof(uint32_t));
    return value;
}

static uint16_t dsi_safe_read_u16(const void *ptr, uint32_t offset)
{
    uint16_t value = 0U;
    const uint8_t *byte_ptr = (const uint8_t *)ptr;

    (void)memcpy(&value, &byte_ptr[offset], sizeof(uint16_t));
    return value;
}

static uint8_t dsi_safe_read_u8(const void *ptr, uint32_t offset)
{
    const uint8_t *byte_ptr = (const uint8_t *)ptr;
    return byte_ptr[offset];
}

static void dsi_safe_write_u32(void *ptr, uint32_t offset, uint32_t value)
{
    uint8_t *byte_ptr = (uint8_t *)ptr;

    (void)memcpy(&byte_ptr[offset], &value, sizeof(uint32_t));
}

/*!
  \brief      configure dsi clock
  \param[in]  none
  \param[out] none
  \retval     none
*/
void dsi_clk_config(void)
{
    rcu_periph_clock_enable(RCU_DSI);
    rcu_dsi_preceding_stage_clock_config(RCU_DSIPRESEL_HXTAL);
    rcu_dsi_clock_div_config(RCU_DSI_DIV2);
}

/*!
  \brief      calculate dphy timing
  \param[in]  lpclk: lp clock
  \param[in]  mipi_rate: mipi dsi rate
  \param[in]  cfg: dhpy timing configuration pointer
  \param[out] none
  \retval     none
*/
void cal_dphy_timing(uint32_t lpclk, uint32_t mipi_rate, dphy_timing_cfg_struct *cfg)
{
    uint32_t byteclk_ns;

    byteclk_ns = 1000000000 / mipi_rate * 8;

    cfg->pll_divider = mipi_rate / 2 / lpclk;

    if(lpclk > 20000000u) {
        cfg->esc_ck_sel = 0x1u;
    } else {
        cfg->esc_ck_sel = 0x0u;
    }

    if(mipi_rate > 200000000) {
        cfg->freq_mode = 1;
    } else {
        cfg->freq_mode = 0;
    }

    /* 50ns < Tlpx */
    cfg->lp_clkc = ceil(60, byteclk_ns) - 1;
    /* 40ns + 4UI < Ths_prep 40ns + 4UI < 85ns +6UI*/
    cfg->dhs_prep  = (ceil((40 + 4 * byteclk_ns / 8), byteclk_ns) - 1);
    /* Ths_prep + Ths_zero > 145ns + 10UI, so Ths_zero 105ns + 6UI */
    cfg->dhs_zero  = ceil((90 + 6 * byteclk_ns / 8), byteclk_ns) - 1;
    /* Ths_trai > max(n * 8 * ui, 60 + n * 4 * ui), n:1 forward_hs, n:4 revers_hs */
    cfg->dhs_trai  = ceil((max((1 * 8 * byteclk_ns / 8), (260 + 1 * 4 * byteclk_ns / 8))), byteclk_ns) - 1;
    /* Ths_exit > 100ns*/
    cfg->dhs_exit  = ceil(230, byteclk_ns) - 1;

    /* 38ns < Tclk_prep < 95ns, so Tclk_prep 50ns */
    cfg->ckhs_prep = (ceil((50), byteclk_ns) - 1) | (0x00);
    /* Tclk_prep + Tclk_zero > 300, so Tclk_zero 320ns*/
    cfg->ckhs_zero = ceil(270, byteclk_ns) - 1;
    /* Tclk_trai > 60ns, so Tclk_trai 60ns */
    cfg->ckhs_trai = ceil((200), byteclk_ns) - 1;
    /* Ths_exit > 100ns*/
    cfg->ckhs_exit = ceil((230), byteclk_ns) - 1;

    /* dlcfg =  4 * Tlpx + Ths_prep(programmed) + Ths_zero(programmed) + 4 */
    cfg->dlcfg = cfg->lp_clkc + cfg->dhs_prep + cfg->dhs_zero + 4;

    /* ck_hs2lp = Tclk_tail + Ths_exit + 3 */
    cfg->ck_hs2lp = cfg->ckhs_trai + cfg->ckhs_exit + 3;
    /* ck_lp2hs = 4 * Tlpx + Tclk_prep + Tclk_zero + Tclk_pre(8UI) + 2byteclk */
    cfg->ck_lp2hs = cfg->lp_clkc + cfg->ckhs_prep + 1 + cfg->ckhs_zero + 1 + 1 + 2;
}

/*!
  \brief      get dsi dphy configuration
  \param[in]  lcm: lcm struct pointer
  \param[in]  cfg: dphy configuration pointer
  \param[out] none
  \retval     none
*/
static void dsi_dphy_cfg_get(lcm_info_struct *lcm, dsi_dphy_cfg_struct *cfg)
{
    uint8_t bpp = 0;

    cfg->dsi_timing.hact = lcm->hact;
    cfg->dsi_timing.vact = lcm->vact;
    cfg->format = lcm->format;
    cfg->lane_num = lcm->lane_num;
    cfg->channel = lcm->channel;
    cfg->mode = lcm->mode;

    switch(lcm->format) {
    case MIPI_DSI_FMT_RGB565:
        bpp = 16;
        break;
    case MIPI_DSI_FMT_RGB666:
        bpp = 18;
        break;
    case MIPI_DSI_FMT_RGB666_PACKED:
    case MIPI_DSI_FMT_RGB888:
    default:
        bpp = 24;
        break;
    }

    /* for hswc/hbpc/hfpc/hactc  */
    cfg->dsi_timing.hswc = (uint16_t)(lcm->hsw * ((double)hs_rate / 8 / pixel_clk));
    cfg->dsi_timing.hbpc = (uint16_t)(lcm->hbp * ((double)hs_rate / 8 / pixel_clk));
    cfg->dsi_timing.hfpc = (uint16_t)(lcm->hfp * ((double)hs_rate / 8 / pixel_clk));
    cfg->dsi_timing.hactc = (uint16_t)(lcm->hact * ((double)hs_rate / 8 / pixel_clk));

    if(lcm->vsw < 2) {
        LOG("[error]lcm vsyc width is %u < 2\r\n", lcm->vsw);
    } else {
        cfg->dsi_timing.vswc = lcm->vsw;
    }
    if(lcm->vbp < 1) {
        LOG("[error]lcm vbpc width is %u < 2\r\n", lcm->vbp);
    } else {
        cfg->dsi_timing.vbpc = lcm->vbp;
    }
    if(lcm->vfp < 1) {
        LOG("[error]lcm vfpc width is %u < 2\r\n", lcm->vfp);
    } else {
        cfg->dsi_timing.vfpc = lcm->vfp;
    }

    cfg->total_pixel_byte = bpp * cfg->dsi_timing.vact * cfg->dsi_timing.hact / 8;
    cal_dphy_timing(lpclk, hs_rate, &(cfg->dphy_timing));
}

/*!
  \brief      mipi dsi packet format is long or not
  \param[in]  type: MIPI DSI data type of the packet
  \param[out] none
  \retval     ret: true if the packet for the given data type is a long packet
*/
static bool mipi_dsi_packet_format_is_long(uint8_t type)
{
    switch(type) {
    case MIPI_DSI_PPS_LONG_WRITE:
    case MIPI_DSI_NULL_PACKET:
    case MIPI_DSI_BLANKING_PACKET:
    case MIPI_DSI_GENERIC_LONG_WRITE:
    case MIPI_DSI_DCS_LONG_WRITE:
    case MIPI_DSI_LOOSELY_PACKED_PIXEL_STREAM_YCBCR20:
    case MIPI_DSI_PACKED_PIXEL_STREAM_YCBCR24:
    case MIPI_DSI_PACKED_PIXEL_STREAM_YCBCR16:
    case MIPI_DSI_PACKED_PIXEL_STREAM_30:
    case MIPI_DSI_PACKED_PIXEL_STREAM_36:
    case MIPI_DSI_PACKED_PIXEL_STREAM_YCBCR12:
    case MIPI_DSI_PACKED_PIXEL_STREAM_16:
    case MIPI_DSI_PACKED_PIXEL_STREAM_18:
    case MIPI_DSI_PIXEL_STREAM_3BYTE_18:
    case MIPI_DSI_PACKED_PIXEL_STREAM_24:
        return true;
    }

