wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Examples/DSI/DSI_video_mode_display/dsi_lcd.c
    return false;
}

/*!
  \brief      mipi dsi hs write data
  \param[in]  msg: pointer a message to transfer
  \param[out] none
  \retval     none
*/
static void mipi_dsi_hs_write(mipi_dsi_msg_struct *msg)
{
    uint32_t fifo_st = 0U;
    uint32_t data_word = 0U;
    uint32_t i = 0U;
    uint32_t remaining_bytes = 0U;

    /* determine whether the packet format is long */
    if(mipi_dsi_packet_format_is_long(msg->type)) {
        for(i = 0U; i < msg->tx_len; i += 4U) {
            do {
                fifo_st = dsi_fifo_status_get(DSI_FIFOSTAT_HSDTFIFOF);
            } while(fifo_st != 0U);

            /* safely read 4 bytes to avoid alignment issues */
            remaining_bytes = msg->tx_len - i;
            if(remaining_bytes >= 4U) {
                data_word = dsi_safe_read_u32(msg->tx_buf, i);
            } else {
                /* handle remaining bytes */
                data_word = 0U;
                (void)memcpy(&data_word, &((const uint8_t *)msg->tx_buf)[i], remaining_bytes);
            }
            /* HS write data */
            dsi_hs_data_write(data_word);
        }

        do {
            fifo_st = dsi_fifo_status_get(DSI_FIFOSTAT_HSCTLFIFOF);
        } while(fifo_st);

        dsi_hs_control_set(msg->type, msg->channel, msg->tx_len);
    } else {
        do {
            fifo_st = dsi_fifo_status_get(DSI_FIFOSTAT_HSCTLFIFOF);
        } while(fifo_st != 0U);

        if(0U == (msg->tx_len)) {
            dsi_hs_control_set(msg->type, msg->channel, msg->tx_len);
        } else if(1U == (msg->tx_len)) {
            uint32_t byte_data = (uint32_t)dsi_safe_read_u8(msg->tx_buf, 0U);
            dsi_hs_control_set(msg->type, msg->channel, byte_data);
        } else {
            uint32_t short_data = (uint32_t)dsi_safe_read_u16(msg->tx_buf, 0U);
            dsi_hs_control_set(msg->type, msg->channel, short_data);
        }
    }
}

/*!
  \brief      mipi dsi lp write data
  \param[in]  msg: pointer a message to transfer
  \param[out] none
  \retval     none
*/
static void mipi_dsi_lp_write(mipi_dsi_msg_struct *msg)
{
    uint32_t fifo_st = 0U;
    uint32_t data_word = 0U;
    uint32_t i = 0U;
    uint32_t remaining_bytes = 0U;

    if(mipi_dsi_packet_format_is_long(msg->type)) {
        /* transmit using LP data FIFO */
        for(i = 0U; i < msg->tx_len; i += 4U) {
            do {
                fifo_st = dsi_fifo_status_get(DSI_FIFOSTAT_LPDTFIFOF);
            } while(fifo_st != 0U);

            /* safely read 4 bytes to avoid alignment issues */
            remaining_bytes = msg->tx_len - i;
            if(remaining_bytes >= 4U) {
                data_word = dsi_safe_read_u32(msg->tx_buf, i);
            } else {
                /* handle remaining bytes */
                data_word = 0U;
                (void)memcpy(&data_word, &((const uint8_t *)msg->tx_buf)[i], remaining_bytes);
            }
            dsi_lp_data_write(data_word);
        }

        /* wait for FIFO empty */
        do {
            fifo_st = dsi_fifo_status_get(DSI_FIFOSTAT_LPCTLFIFOF);
        } while(fifo_st);

        dsi_lp_control_set(msg->type, msg->channel, msg->tx_len);
    } else {
        /* wait for FIFO empty */
        do {
            fifo_st = dsi_fifo_status_get(DSI_FIFOSTAT_LPCTLFIFOF);
        } while(fifo_st != 0U);

        if(0U == (msg->tx_len)) {
            dsi_lp_control_set(msg->type, msg->channel, msg->tx_len);
        } else if(1U == (msg->tx_len)) {
            uint32_t byte_data = (uint32_t)dsi_safe_read_u8(msg->tx_buf, 0U);
            dsi_lp_control_set(msg->type, msg->channel, byte_data);
        } else {
            uint32_t short_data = (uint32_t)dsi_safe_read_u16(msg->tx_buf, 0U);
            dsi_lp_control_set(msg->type, msg->channel, short_data);
        }
    }
}

/*!
  \brief      mipi dsi write data
  \param[in]  msg: pointer a message to transfer
  \param[out] none
  \retval     none
*/
static void mipi_dsi_write(mipi_dsi_msg_struct *msg)
{
    /* DCS/Generic word count values need to be written before DCS or Generic long write */
    if(mipi_dsi_packet_format_is_long(msg->type)) {
        dsi_dcs_word_count_set(msg->tx_len);
    } else {
        dsi_dcs_word_count_set(0);
    }

    if(msg->mode) {
        mipi_dsi_lp_write(msg);
    } else {
        mipi_dsi_hs_write(msg);
    }
}

/*!
  \brief      mipi dsi hs read data
  \param[in]  msg: pointer a message to read
  \param[out] none
  \retval     none
*/
static void mipi_dsi_hs_read(mipi_dsi_msg_struct *msg)
{
    uint32_t data_word = 0U;
    uint32_t word_cnt = 0U;
    uint32_t i = 0U;
    uint32_t remaining_bytes = 0U;

    /* waiting for rx data available */
    do {
    } while(0U == lp_rd_avail);

    /* read word_cnt words */
    word_cnt = msg->rx_len / 4U;
    for(i = 0U; i < word_cnt; i++) {
        data_word = dsi_lp_data_read();
        dsi_safe_write_u32(msg->rx_buf, i * 4U, data_word);
    }

    /* need read other bytes */
    remaining_bytes = msg->rx_len % 4U;
    if(remaining_bytes != 0U) {
        data_word = dsi_hs_data_read();
        (void)memcpy(&((uint8_t *)msg->rx_buf)[word_cnt * 4U], &data_word, remaining_bytes);
    }
}

/*!
  \brief      mipi dsi lp read data
  \param[in]  msg: pointer a message to transfer
  \param[out] none
  \retval     none
*/
static void mipi_dsi_lp_read(mipi_dsi_msg_struct *msg)
{
    uint32_t data_word = 0U;
    uint32_t word_cnt = 0U;
    uint32_t i = 0U;
    uint32_t remaining_bytes = 0U;

    /* waiting for rx data available */
    do {
    } while(0U == lp_rd_avail);

    /* read word_cnt words */
    word_cnt = msg->rx_len / 4U;
    for(i = 0U; i < word_cnt; i++) {
        data_word = dsi_lp_data_read();
        dsi_safe_write_u32(msg->rx_buf, i * 4U, data_word);
    }

    /* need read other bytes */
    remaining_bytes = msg->rx_len % 4U;
    if(remaining_bytes != 0U) {
        data_word = dsi_lp_data_read();
        (void)memcpy(&((uint8_t *)msg->rx_buf)[word_cnt * 4U], &data_word, remaining_bytes);
    }
}

/*!
  \brief      mipi dsi read data
  \param[in]  msg: pointer a message to transfer
  \param[out] none
  \retval     none
*/
static void mipi_dsi_read(mipi_dsi_msg_struct *msg)
{
    if(msg->mode) {
        mipi_dsi_lp_read(msg);
    } else {
        mipi_dsi_hs_read(msg);
    }
}

/*!
  \brief      mipi dsi device transfer
  \param[in]  msg: pointer to a message to transfer
  \param[out] none
  \retval     none
*/
void mipi_dsi_device_transfer(mipi_dsi_msg_struct *msg)
{
    uint32_t data = 0;
    uint32_t stop_auto_refresh = 0;

    /* need stop autofresh and waiting for frame done */
    if(DSI_WCTL & DSI_WCTL_ARM) {
        dsi_wrapper_auto_refresh_mode_config(DSI_AUTO_REFRESH_MODE_DISABLE);
        do {
        } while(ar_mode_bus_busy);
        stop_auto_refresh = 1;
    }

    if(msg->rx_buf && msg->rx_len) {
        if(msg->mode) {
            data = 1 << 15;
        } else {
            data = 0;
        }
        data |= ((msg->rx_len) & 0x7FF);
        DSI_DCSWC = 1;
        DSI_MAXRPKTCTL = data;
    }

    /* write message */
    mipi_dsi_write(msg);

    if(msg->rx_buf && msg->rx_len) {
        mipi_dsi_read(msg);
    }

    if(msg->mdelay) {
        delay_1ms(msg->mdelay);
    }

    if(stop_auto_refresh) {
        DSI_WCTL |= DSI_WCTL_ARM;
    }
}

/*!
  \brief      lcm partial upadte
  \param[in]  start_x: start position of x
  \param[in]  end_x: end position of x
  \param[in]  start_y: start position of y
  \param[in]  end_y: end position of y
  \param[out] none
  \retval     none
*/
void lcm_partial_upadte_set(uint16_t start_x, uint16_t end_x, uint16_t start_y, uint16_t end_y)
{
    uint32_t total_byte = 0;
    uint8_t data[5] = {0};
    uint8_t bpp = 0;
    mipi_dsi_msg_struct msg = {0};

    /* Determine the number of bytes corresponding to different color formats */
    switch(lcm_info.format) {
    case MIPI_DSI_FMT_RGB565:
        bpp = 16;
        break;
    case MIPI_DSI_FMT_RGB666:
        bpp = 18;
        break;
    case MIPI_DSI_FMT_RGB666_PACKED:
    case MIPI_DSI_FMT_RGB888:
    default:
        bpp = 24;
        break;
    }

    total_byte = (end_x - start_x + 1) * (end_y - start_y + 1) * bpp / 8;
    msg.channel = lcm_info.channel;
    msg.type = MIPI_DSI_DCS_LONG_WRITE;
    msg.mode = LOW_POWER;
    msg.mdelay = 0;
    msg.tx_len = 5;

