wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Examples/DSI/DSI_video_mode_display/dsi_lcd.c
    /* set column address (x coordinate) */
    data[0] = MIPI_DCS_SET_COLUMN_ADDRESS;          /* DCS command */
    data[1] = (uint8_t)((start_x >> 8) & 0xFF);
    data[2] = (uint8_t)((start_x) & 0xFF);
    data[3] = (uint8_t)((end_x >> 8) & 0xFF);
    data[4] = (uint8_t)((end_x) & 0xFF);
    msg.tx_buf = data;
    mipi_dsi_device_transfer(&msg);

    /* set page address (y coordinate) */
    data[0] = MIPI_DCS_SET_PAGE_ADDRESS;            /* DCS command */
    data[1] = (uint8_t)((start_y >> 8) & 0xFF);
    data[2] = (uint8_t)((start_y) & 0xFF);
    data[3] = (uint8_t)((end_y >> 8) & 0xFF);
    data[4] = (uint8_t)((end_y) & 0xFF);
    msg.tx_buf = data;
    mipi_dsi_device_transfer(&msg);

    dsi_wrapper_wms_size_set((MDMA_MAX_BYTES >> 2), total_byte >> 2);
}

/*!
  \brief      dsi initialization
  \param[in]  dsi_cfg: dsi controller config
  \param[out] none
  \retval     none
*/
void dsi_dphy_init(dsi_dphy_cfg_struct *dsi_cfg)
{
    uint32_t int_flag = 0;

    /* enable DSI DPHY */
    dsi_dphy_dfe_reset_enable();
    /* enable DSI interrupt */
    dsi_interrupt_enable(DSI_INT_RXSOTE);
    dsi_interrupt_enable(DSI_INT_RXSOTSYNCE);
    dsi_interrupt_enable(DSI_INT_RXEOTSYNCE);
    dsi_interrupt_enable(DSI_INT_RXESCMEE);
    dsi_interrupt_enable(DSI_INT_RXLPTXSYNCE);
    dsi_interrupt_enable(DSI_INT_RXPTOE);
    dsi_interrupt_enable(DSI_INT_RXFCTLE);
    dsi_interrupt_enable(DSI_INT_RXECCSE);
    dsi_interrupt_enable(DSI_INT_RXECCME);
    dsi_interrupt_enable(DSI_INT_RXCHKE);
    dsi_interrupt_enable(DSI_INT_RXDSIDTNR);
    dsi_interrupt_enable(DSI_INT_RXDSIVCIDINV);
    dsi_interrupt_enable(DSI_INT_TXFCTLE);
    dsi_interrupt_enable(DSI_INT_TXECCSE);
    dsi_interrupt_enable(DSI_INT_TXECCME);
    dsi_interrupt_enable(DSI_INT_TXCHKE);
    dsi_interrupt_enable(DSI_INT_TXDSIDTNR);
    dsi_interrupt_enable(DSI_INT_TXDSIVCIDINV);
    dsi_interrupt_enable(DSI_INT_HCONT);
    dsi_interrupt_enable(DSI_INT_LCONT);
    dsi_interrupt_enable(DSI_INT_HSTXTO);
    dsi_interrupt_enable(DSI_INT_LPRXTO);
    dsi_interrupt_enable(DSI_INT_TAACKTO);
    dsi_interrupt_enable(DSI_INT_ACKNE);
    dsi_interrupt_enable(DSI_INT_RXINVTXCE);
    dsi_interrupt_enable(DSI_INT_RXDSIPV);
    dsi_interrupt_enable(DSI_INT_SPKTCMDS);
    dsi_interrupt_enable(DSI_INT_RXCONTDET);
    dsi_interrupt_enable(DSI_INT_DPILTO);
    dsi_interrupt_enable(DSI_INT_DPIPE);
    dsi_wrapper_interrupt_enable(DSI_INT_PLL_UNLOCK);

    /* disable eot short packet */
    dsi_eot_transmission_disable();
    /* disable clock in blank packet */
    dsi_clock_stopping_enable();

    /* DSI data line number set */
    dsi_data_lanes_number_set(dsi_cfg->lane_num);
    /* 0:disable command mode, 1:enable DSC or generic transfer */
    dsi_command_mode_supported_set(0x01);
    /* sel low power data from ip */
    dsi_wrapper_lp_cmd_data_source_set(DSI_LP_DATASRC_LPDATA);
    DSI_WCTL &= (~(DSI_WCTL_CLM | DSI_WCTL_SHTD));
    /* DSI function program register */
    if(COMMAND_MODE == dsi_cfg->mode) {
        dsi_command_mode_virtual_channel_set(dsi_cfg->channel);
        /* select DMA for DSI */
        dsi_wrapper_tli_dma_mode_config(DSI_TLI_DMA_MODE_ENABLE);
        /* 0: disable video mode */
        dsi_video_mode_color_format_set(0x00);
        /* hs data from wrapper */
        dsi_wrapper_hs_cmd_data_source_set(DSI_HS_DATASRC_TLI_DMA);
        dsi_wrapper_wms_size_set((MDMA_MAX_BYTES >> 2), ((dsi_cfg->total_pixel_byte) >> 2));
        /* attention te_cfg */
        DSI_WCTL |= DSI_WCTL_TESRC;
        DSI_WINTEN |= DSI_WINTEN_TEIE;
        /* wms end interrupt enable */
        DSI_WWMS_INTMSK |= DSI_WWMS_WCTL_WMS_END;
    } else {
        /* select DMA disable for DSI */
        dsi_wrapper_tli_dma_mode_config(DSI_TLI_DMA_MODE_DISABLE);

        dsi_video_mode_virtual_channel_set(dsi_cfg->channel);
        /* DSI wrapper format set */
        dsi_wrapper_rgb_data_format_set(dsi_cfg->format);
        dsi_video_mode_color_format_set(dsi_cfg->format);
        /* DSI video mode format */
        dsi_video_mode_format_set(dsi_cfg->mode);
        /* must disable bta */
        dsi_video_bta_disable();
    }

    /* DSI high speed tranmission timeout */
    dsi_hs_tx_timeout_set(0xFFFFFF);
    /* DSI low power reception timeout */
    dsi_lp_rx_timeout_set(0xFFFFFF);
    /* DSI turn around timeout */
    dsi_turnaround_timeout_set(0x1F);
    /* DSI device reset timer */
    dsi_device_reset_timer_set(0xFFFF);
    /* DSI DPI resolution */
    dsi_dpi_resolution_set(dsi_cfg->dsi_timing.hact, dsi_cfg->dsi_timing.vact);

    /* DSI horizontal sync active count configuration */
    dsi_horizontal_sync_active_count_set(dsi_cfg->dsi_timing.hswc);
    /* DSI horizontal front porch count configuration */
    dsi_horizontal_front_porch_count_set(dsi_cfg->dsi_timing.hfpc);
    /* DSI horizontal back porch count configuration */
    dsi_horizontal_back_porch_count_set(dsi_cfg->dsi_timing.hbpc);
    /* DSI horizontal active area count configuration */
    dsi_horizontal_active_count_set(dsi_cfg->dsi_timing.hactc);

    /* DSI vertical sync active count configuration */
    dsi_vertical_sync_active_count_set(dsi_cfg->dsi_timing.vswc);
    /* DSI vertical front porch count configuration */
    dsi_vertical_front_porch_count_set(dsi_cfg->dsi_timing.vfpc);
    /* DSI vertical back porch count configuration */
    dsi_vertical_back_porch_count_set(dsi_cfg->dsi_timing.vbpc);

    /* DSI initialization count configuration */
    dsi_init_counter_set(0xD07);
    /* DSI error auto recovery control */
    dsi_error_auto_recovery_disable(DSI_ERR_AUTO_REC_ECC_MUL);
    dsi_error_auto_recovery_disable(DSI_ERR_AUTO_REC_INVLD_DT);
    dsi_error_auto_recovery_disable(DSI_ERR_AUTO_REC_HI_CONT);
    dsi_error_auto_recovery_disable(DSI_ERR_AUTO_REC_LO_CONT);
    dsi_error_auto_recovery_disable(DSI_ERR_AUTO_REC_HS_RX_TO);
    dsi_error_auto_recovery_disable(DSI_ERR_AUTO_REC_LP_RX_TO);

