wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Examples/DSI/DSI_video_mode_display/dsi_lcd.c
    /* DSI Dphy parameter configuration */
    dsi_dphy_hs_prepare_time_set(dsi_cfg->dphy_timing.dhs_prep);
    dsi_dphy_hs_zero_time_set(dsi_cfg->dphy_timing.dhs_zero);
    dsi_dphy_hs_trail_time_set(dsi_cfg->dphy_timing.dhs_trai);
    dsi_dphy_hs_exit_time_set(dsi_cfg->dphy_timing.dhs_exit);

    /* DSI Dphy clock lane timing parameter configuration */
    dsi_dphy_clk_prepare_time_set(dsi_cfg->dphy_timing.ckhs_prep);
    dsi_dphy_clk_zero_time_set(dsi_cfg->dphy_timing.ckhs_zero);
    dsi_dphy_clk_trail_time_set(dsi_cfg->dphy_timing.ckhs_trai);
    dsi_dphy_clk_exit_time_set(dsi_cfg->dphy_timing.ckhs_exit);

    /* DSI Dphy trim1 control */
    DSI_DPHY_TRIMCTL1 = ((dsi_cfg->dphy_timing.pll_divider) & 0x7F) |
                        (((uint32_t)(dsi_cfg->dphy_timing.esc_ck_sel) & 0x1) << 31);
    DSI_DPHY_TRIMCTL1 |= DSI_DPHY_TRIMCTL1_CDPD0;

    /* DSI frequency mode control */
    dsi_ddr_freq_mode_set(dsi_cfg->dphy_timing.freq_mode);
    /* DSI low power byte clock configuration */
    dsi_lp_byte_clk_config(dsi_cfg->dphy_timing.lp_clkc);

    /* DSI data lane high low switch count configuration */
    dsi_data_lane_switch_count_set(dsi_cfg->dphy_timing.dlcfg);
    /*  DSI clock lane switching configuration */
    dsi_clk_hs_to_lp_switch_count_set(dsi_cfg->dphy_timing.ck_hs2lp);
    dsi_clk_lp_to_hs_switch_count_set(dsi_cfg->dphy_timing.ck_lp2hs);

    /* DSI device ready */
    dsi_device_ready_set(0x1);

    /* waiting for initialization done */
    do {
        int_flag = DSI_INTSTAT0;
    } while(0 == (DSI_INTSTAT0_INIT_DONE & int_flag));
}

/*!
  \brief      read register
  \param[in]  addr: address
  \param[in]  len: length
  \param[out] none
  \retval     none
*/
void lcm_reg_read(uint8_t addr, uint8_t len)
{
    uint8_t tx_para = 0;
    uint32_t read_val = 0;

    tx_para = addr;
    mipi_dsi_msg_struct rx_msg = {
        .channel = 0,
        .type = MIPI_DSI_GENERIC_READ_REQUEST_1_PARAM,
        .mode = LOW_POWER,
        .mdelay = 0,
        .tx_len = 1,
        .tx_buf = &tx_para,
        .rx_len = len,
        .rx_buf = &read_val,
    };

    mipi_dsi_device_transfer(&rx_msg);
}

/*!
  \brief      test LCM DSI DPHY
  \param[in]  none
  \param[out] none
  \retval     none
*/
void dsi_dphy_lcm_test(void)
{
#ifdef LCM_TEST
    uint32_t i = 0;
    uint32_t len_cmd = sizeof(init_cmds) / sizeof(init_cmds[0]);
    mipi_dsi_msg_struct msg = {0};

    dsi_dphy_cfg_get(&lcm_info, &dsi_cfg);

    rcu_periph_clock_enable(BACKLIGHT_GPIO_CLK);
    gpio_mode_set(BACKLIGHT_GPIO_PORT, GPIO_MODE_OUTPUT, GPIO_PUPD_PULLUP, BACKLIGHT_PIN);
    gpio_output_options_set(BACKLIGHT_GPIO_PORT, GPIO_OTYPE_PP, GPIO_OSPEED_100_220MHZ, BACKLIGHT_PIN);
    gpio_bit_reset(BACKLIGHT_GPIO_PORT, BACKLIGHT_PIN);

    rcu_periph_clock_enable(LCD_RST_GPIO_CLK);
    gpio_mode_set(LCD_RST_GPIO_PORT, GPIO_MODE_OUTPUT, GPIO_PUPD_PULLUP, LCD_RST_PIN);
    gpio_output_options_set(LCD_RST_GPIO_PORT, GPIO_OTYPE_PP, GPIO_OSPEED_100_220MHZ, LCD_RST_PIN);
    gpio_bit_set(LCD_RST_GPIO_PORT, LCD_RST_PIN);

    /* res = 1, mdelay 1ms */
    gpio_bit_set(LCD_RST_GPIO_PORT, LCD_RST_PIN);
    delay_1ms(4);
    /* res = 0, mdelay 10ms */
    gpio_bit_reset(LCD_RST_GPIO_PORT, LCD_RST_PIN);
    delay_1ms(12);
    /* res = 1, mdelay 120ms */
    gpio_bit_set(LCD_RST_GPIO_PORT, LCD_RST_PIN);
    delay_1ms(120);

    /* backlight */
    gpio_bit_set(BACKLIGHT_GPIO_PORT, BACKLIGHT_PIN);

    if(COMMAND_MODE == dsi_cfg.mode) {
        /* enable dsi te */
        rcu_periph_clock_enable(DSI_TE_GPIO_CLK);
        gpio_af_set(DSI_TE_GPIO_PORT, DSI_TE_AFIO, DSI_TE_PIN);
        gpio_mode_set(DSI_TE_GPIO_PORT, GPIO_MODE_AF, GPIO_PUPD_NONE, DSI_TE_PIN);
        gpio_output_options_set(DSI_TE_GPIO_PORT, GPIO_OTYPE_PP, GPIO_OSPEED_60MHZ, DSI_TE_PIN);
    }

    dsi_dphy_init(&dsi_cfg);

    for(i = 0; i < len_cmd; i++) {
        msg.channel = lcm_info.channel;
        msg.type = init_cmds[i].type;
        msg.mode = init_cmds[i].is_lp;
        msg.mdelay = init_cmds[i].mdelay;
        msg.tx_len = init_cmds[i].len;
        msg.tx_buf = init_cmds[i].data;

        /* transfer DSI device message */
        mipi_dsi_device_transfer(&msg);
    }
#endif  /* LCM_TEST */
}

/*!
  \brief      configure dsi command mode supported function
  \param[in]  supported: dsi host command mode supported
  \param[out] none
  \retval     none
  */
void dsi_command_mode_supported_set(uint32_t supported)
{
    uint32_t reg_val = 0;
    if(0 == supported) {
        reg_val = (DSI_FUNCPRG) & (~DSI_FUNCPRG_SDTWCM);
        DSI_FUNCPRG = reg_val;
    } else {
        reg_val = (DSI_FUNCPRG) & (~DSI_FUNCPRG_SDTWCM);
        DSI_FUNCPRG = ((1 << 13) & DSI_FUNCPRG_SDTWCM) | reg_val;
    }
}

/*!
  \brief      dsi_wrapper_rgb_data_format_set
  \param[in]  format: RGB data format for wrapper
  \param[out] none
  \retval     none
  */
void dsi_wrapper_rgb_data_format_set(uint32_t format)
{
    uint32_t tli_data_format = 0;

    switch(format) {
    case MIPI_DSI_FMT_RGB565:
        tli_data_format = 1;
        break;
    case MIPI_DSI_FMT_RGB666:
        tli_data_format = 2;
        break;
    case MIPI_DSI_FMT_RGB666_PACKED:
    case MIPI_DSI_FMT_RGB888:
    default:
        tli_data_format = 0;
        break;
    }

    DSI_WRGBDF = tli_data_format;
}

/*!
  \brief      dsi irq0 handler
  \param[in]  none
  \param[out] none
  \retval     none
  */
static void dsi_irq0_handler(void)
{
    uint32_t int_st = 0;
    uint32_t int_en = 0;
    uint32_t mask = 0;

    int_st = DSI_INTSTAT0;
    int_en = DSI_INTEN;
    mask = int_st & int_en;

    if(!mask) {
        return;
    }

    if(mask & DSI_INTSTAT0_RXSOTE) {
        LOG("Rx Sot Error Interrupt \r\n");
    }

    if(mask & DSI_INTSTAT0_RXSOTSYNCE) {
        LOG("Rx Sot Sync Error Interrupt \r\n");
    }

    if(mask & DSI_INTSTAT0_RXEOTSYNCE) {
        LOG("Rx Eot Sync Error Interrupt \r\n");
    }

