wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Examples/DSI/DSI_video_mode_display/dsi_lcd.c
    if(mask & DSI_INTSTAT0_RXESCMEE) {
        LOG("Rx Escape Mode Entry Error Interrupt");
    }

    if(mask & DSI_INTSTAT0_RXLPTXSYNCE) {
        LOG("Rx LP Tx Sync Error Interrupt \r\n");
    }

    if(mask & DSI_INTSTAT0_RXPTOE) {
        LOG("Rx Peripheral Timeout Error Interrupt \r\n");
    }

    if(mask & DSI_INTSTAT0_RXFCTLE) {
        LOG("Rx False Control Error Interrupt \r\n");
    }

    if(mask & DSI_INTSTAT0_RXECCSE) {
        LOG("Rx ECC Single Bit Error Interrupt \r\n");
    }

    if(mask & DSI_INTSTAT0_RXECCME) {
        LOG("Rx ECC Multi Bit Error Interrupt \r\n");
    }

    if(mask & DSI_INTSTAT0_RXCHKE) {
        LOG("Rx Checksum Error Interrupt \r\n");
    }

    if(mask & DSI_INTSTAT0_RXDSIDTNR) {
        LOG("Rx DSI Data Type Not Recognized Interrupt \r\n");
    }

    if(mask & DSI_INTSTAT0_RXDSIVCIDINV) {
        LOG("Rx DSI VC ID Invalid Interrupt \r\n");
    }

    if(mask & DSI_INTSTAT0_TXFCTLE) {
        LOG("Tx False Control Error Interrupt \r\n");
    }

    if(mask & DSI_INTSTAT0_TXECCSE) {
        LOG("Tx ECC Single Bit Error Interrupt \r\n");
    }

    if(mask & DSI_INTSTAT0_TXECCME) {
        LOG("Tx ECC Multi Bit Error Interrupt \r\n");
    }

    if(mask & DSI_INTSTAT0_TXCHKE) {
        LOG("Tx Checksum Error Interrupt \r\n");
    }

    if(mask & DSI_INTSTAT0_TXDSIDTNR) {
        LOG("Tx DSI Data Type Not Recognized Interrupt \r\n");
    }

    if(mask & DSI_INTSTAT0_TXDSIVCIDINV) {
        LOG("Tx DSI VC ID Invalid Interrupt \r\n");
    }

    if(mask & DSI_INTSTAT0_HCONT) {
        LOG("High Contention Interrupt \r\n");
    }

    if(mask & DSI_INTSTAT0_LCONT) {
        LOG("Low Contention Interrupt \r\n");
    }

    if(mask & DSI_INTSTAT0_FIFOE) {
        LOG("Fifo Empty Interrupt \r\n");
    }

    if(mask & DSI_INTSTAT0_HSTXTO) {
        LOG("HS Tx Timeout Interrupt \r\n");
    }

    if(mask & DSI_INTSTAT0_LPRXTO) {
        LOG("LP Rx Timeout Interrupt \r\n");
    }

    if(mask & DSI_INTSTAT0_TAACKTO) {
        LOG("Turn_around Ack Timeout Interrupt \r\n");
    }

    if(mask & DSI_INTSTAT0_ACKNE) {
        LOG("ACK With No Error Interrupt \r\n");
    }

    if(mask & DSI_INTSTAT0_RXINVTXCE) {
        LOG("Rx Invalid Transmission Count Error Interrupt \r\n");
    }

    if(mask & DSI_INTSTAT0_RXDSIPV) {
        LOG("Rx DSI Protocol Violation Interrupt \r\n");
    }

    if(mask & DSI_INTSTAT0_SPKTCMDS) {
        LOG("Special Packet Command Sent Interrupt \r\n");
    }

    if(mask & DSI_INTSTAT0_INIT_DONE) {
        LOG("Init Done Interrupt \r\n");
    }

    if(mask & DSI_INTSTAT0_RXCONTDET) {
        LOG("Rx Contention Detected Interrupt \r\n");
    }

    if(mask & DSI_INTSTAT0_DPILTO) {
        LOG("DPI Line Timeout Interrupt \r\n");
    }

    if(mask & DSI_INTSTAT0_DPIPE) {
        LOG("DPI Program Error Interrupt \r\n");
    }

    DSI_INTSTAT0 = mask;

    return;
}

/*!
  \brief      dsi irq1 handler
  \param[in]  none
  \param[out] none
  \retval     none
*/
static void dsi_irq1_handler(void)
{
    uint32_t int_st = 0;

    int_st = DSI_INTSTAT1;

    if(!int_st) {
        return;
    }

    if(int_st & DSI_INTSTAT1_HSDTFIFOFIF) {
        LOG("HS data fifo full\r\n");
    }

    if(int_st & DSI_INTSTAT1_LPDTFIFOFIF) {
        LOG("LP data fifo full\r\n");
    }

    if(int_st & DSI_INTSTAT1_LPCTLFIFOFIF) {
        LOG("LP ctrl fifo full\r\n");
    }

    if(int_st & DSI_INTSTAT1_HSCTLFIFOFIF) {
        LOG("HS ctrl fifo full\r\n");
    }

    if(int_st & DSI_INTSTAT1_RDDTAIF) {
        lp_rd_avail = 1;
    }

    if(int_st & DSI_INTSTAT1_TETGIF) {
        LOG("TE trigger message received\r\n");
    }

    DSI_INTSTAT1 = int_st;
}

/*!
  \brief      dsi irq2 handler
  \param[in]  none
  \param[out] none
  \retval     none
*/
static void dsi_irq2_handler(void)
{
    uint32_t int_st = 0;
    uint32_t int_en = 0;
    uint32_t mask = 0;

    int_st = DSI_WINTSTAT;
    int_en = DSI_WINTEN;
    mask = int_st & int_en;

    if(!mask) {
        return;
    }

    if(mask & DSI_WINTSTAT_TEIF) {
        if(DSI_WCTL & DSI_WCTL_ARM) {
            /* waiting for te to start, and bus busy */
            ar_mode_bus_busy = 1;
        }
    }

    if(mask & DSI_WINTSTAT_PLLLKIF) {
        LOG("PLL lock\r\n");
    }

    if(mask & DSI_WINTSTAT_PLLULKIF) {
        LOG("PLL unlock\r\n");
    }

    DSI_WINTC = mask;
}

/*!
  \brief      dsi irq3 handler
  \param[in]  none
  \param[out] none
  \retval     none
*/
static void dsi_irq3_handler(void)
{
    uint32_t int_st = 0;
    uint32_t int_en = 0;
    uint32_t mask = 0;

    int_en = DSI_WWMS_INTMSK;
    int_st = DSI_WWMS_WCTL;
    mask = int_en & int_st;

    if(!mask) {
        return;
    }

    if(mask & DSI_WWMS_WCTL_WMS_END) {
        /* frame end, and bus idle */
        ar_mode_bus_busy = 0;
        DSI_WWMS_WCTL |= DSI_WWMS_WCTL_WMS_END;
    }

    return;
}

/*!
  \brief      mipi dsi irq handler
  \param[in]  none
  \param[out] none
  \retval     none
*/
void mipi_dsi_irq_handler(void)
{
    dsi_irq0_handler();
    dsi_irq1_handler();
    dsi_irq2_handler();
    dsi_irq3_handler();
}
